def factor(f):
    if f == 1:
        return 1
    else:
        return factor(f-1)*f

def sochet(k, k1):
    o = factor(k)/(factor(k1) * factor(k-k1))
    return o

def razmechpov(rr, rr1):
    hrr = rr**(rr1)
    return hrr
def razmech(r, r1):
    hr = factor(r)/((factor(r-r1)))
    return hr

#задание 1 В урне 4 белых и 6 черных шаров. Из урны наудачу извлечены 2 шара. Найти вероятность того, что они разного цвета.

s1 = int(input("Введите количество белых шаров "))
s2 = int(input("Введите количество  черных шаров "))
PA1= (sochet(s1, 1) * sochet(s2, 1))/(sochet(s1+s2, 2))
print(PA1)

# #задание 2 Какова вероятность того, что пятизначное число состоит из цифр 0, 1, 2, 3, 4.

m = int(input("Введите количество знаков"))
n = int(input("Введите количество чисел"))
PA2 = ((m-1)*(m**(m-1)))/(((m+n-1))*((m+n)**(m-1)))
print(PA2)


# #задание 3 Студент  сдает  три  экзамена.
# Вероятность  успешной  сдачи  первого  экзамена  0,9,  второго  –  0,65,  третьего  –  0,35.
# Найти  вероятность  того,  что  он  не  сдаст  хотя  бы  один экзамен.

I3 = float(input("Введите ввероятность сдачи 1 экзамена "))
II3 = float(input("Введите ввероятность сдачи 2 экзамена "))
III3 = float(input("Введите ввероятность сдачи 1 экзамена "))
PAO = I3*II3*III3
PA3 = (1 - PAO)
print(PA3)

# #задание 4
# Пароль для входа в компьютерную базу данных состоит из 7 цифр.
# Какова вероятность правильного набора пароля с первого раза,
# если комбинация цифр является строго возрастающей последовательностью.

n4=int(input("Введите количество чисел в пароле"))
m4 = int(input("Введите количество попыток"))
PA4 = m4/(sochet(10, 10-n4))
print(PA4)


# #задание 5 Бросают игральный кубик.
# Какова вероятность того, что выпало четное число очков,
# если известно, что число выпавших очков меньше пяти?

m5 = 2
n5 = 4
PA5 = 2/4
print(PA5)

# #задание 6 В лифт 20-этажного дома на первом этаже зашли 3 человека. И поехали.
# Найти вероятность того, что:
# а) они выйдут на разных этажах;
# б) двое выйдут на одном этаже;
# в) все выйдут на одном этаже.

n6 = int(input("Введите количество этажей"))-1
m6 = int(input("Введите количество людей"))
#1
A6 = razmech(n6, m6)/razmechpov(n6, m6)
#2
B6 = (n6*(n6-1)*m6)/(razmechpov(n6, m6))
#3
C6= (n6)/(n6**3)
print(A6, B6, C6)

#задание 7 Из 36 карт наугад выбираются 3.
# Вычислите вероятность того, что среди них будут король и дама.

kol = int(input("Введите количество выбранных карт"))
cev = int(input("Введите количество желаемых карт"))
n7 = sochet(36, kol)
m7 = (cev*2*4)*(36-kol)
PA7=m7/n7
print(PA7)


# #задание 8 Для трех розничных торговых предприятий определен плановый уровень
# прибыли.
# Вероятность того, что первое предприятие выполнит план прибыли, равна 90%, для второго она составляет 95%, для третьего 100%.
# Какова вероятность того, что плановый уровень прибыли будет достигнут: а) всеми предприятиями; б) только двумя предприятиями; в) хотя бы одним предприятием.

I8 = (int(input("Введите уровень прибыли 1 предприятия"))/100)
II8 = (int(input("Введите уровень прибыли 2 предприятия"))/100)
III8 = (int(input("Введите уровень прибыли 3 предприятия"))/100)
#1
A8 = I8 * II8 * III8
#2
B8 = I8*(1-II8)+(II8*(1-I8))
print(A8, B8, III8)

# #задание 9 Экзаменационный  билет  содержит  3  вопроса.
# Вероятности  того,  что  студент
# ответит на первый и второй вопросы одинаковы и равны 0,9; на третий – 0,8.
# Найти вероятность того, что студент ответит: а) на все вопросы; б) по крайней мере, на два вопроса.

I9 = float(input("Введите вероятность правильного ответа на 1 вопрос"))
II9 = float(input("Введите вероятность правильного оответа на 2 вопрос"))
III9 = float(input("Введите вероятность правильного оответа на 3 вопрос"))
#1
A9 = I9 * II9 * III9
#2
B9 = A9+(I9*II9)+(II9 * III9)+(I9 * III9) #почему
if B9>1:
    B9=1
print(A9, B9)

#задание 10 Была  проведена  одна  и  та  же  контрольная  работа  в  трех  группах.
# В  первой группе  из  30  студентов  8  выполнили  работу  на  «отлично»,
# во  второй,  где  28  студентов,  –  6 «отличных»  работ,  в  третьей,  где  27  студентов,  –  9  работ  выполнены  на  «отлично».
#Найти вероятность  того,  что  первая  выбранная  наудачу  работа  из  работ,  принадлежащих  группе, которая также выбрана наудачу, окажется «отличной».

A10 = [int(value) for value in input("Введите количество человек в 1 группе и количество отличников через пробел").split()]
B10 = [int(value) for value in input("Введите количество человек в 2 группе и количество отличников через пробел").split()]
C10 = [int(value) for value in input("Введите количество человек в 3 группе и количество отличников через пробел").split()]
PH1 = PH2 = PH3 = (1/3)
for i in range(len(A10)):
    PAH1 = (A10[i])/(A10[i-1])
for j in range(len(B10)):
    PAH2 = (B10[j])/(B10[j-1])
for i in range(len(C10)):
    PAH3 = (C10[i])/(C10[i-1])
PA10 = (PAH1*PH1)+(PAH2*PH2)+(PAH3*PH3)
print(PA10)
