def factor(f):
    if f == 1:
        return 1
    else:
        return factor(f-1)*f

def sochet(k, k1):
    o = factor(k)/(factor(k1) * factor(k-k1))
    return o

def razmechpov(rr, rr1):
    hrr = rr**(rr1)
    return hrr
def razmech(r, r1):
    hr = factor(r)/((factor(r-r1)))
    return hr

#задание 1 В урне 4 белых и 6 черных шаров. Из урны наудачу извлечены 2 шара. Найти вероятность того, что они разного цвета.

s1 = int(input("Введите количество белых шаров "))
s2 = int(input("Введите количество  черных шаров "))
PA1= (sochet(s1, 1) * sochet(s2, 1))/(sochet(s1+s2, 2))
print(PA1)

#задание 2 Какова вероятность того, что пятизначное число состоит из цифр 0, 1, 2, 3, 4.

m = int(input("Введите количество знаков"))
n = int(input("Введите количество чисел"))
PA2 = ((m-1)*(m**(m-1)))/(((m+n-1))*((m+n)**(m-1)))
print(PA2)

#задание 3 Студент  сдает  три  экзамена.  Вероятность  успешной  сдачи  первого  экзамена  0,9,  второго  –  0,65,  третьего  –  0,35.  Найти  вероятность  того,  что  он  не  сдаст  хотя  бы  один экзамен.

I3 = float(input("Введите ввероятность сдачи 1 экзамена "))
II3 = float(input("Введите ввероятность сдачи 2 экзамена "))
III3 = float(input("Введите ввероятность сдачи 1 экзамена "))
PAO = I3*II3*III3
PA3 = (1 - PAO)
print(PA3)

#задание 4

n4=int(input("Введите количество чисел в пароле"))
m4 = int(input("Введите количество попыток"))
PA4 = m4/(sochet(10, 10-n4))
print(PA4)


#задание 5

m5 = 2
n5 = 4
PA5 = 2/4
print(PA5)

# #задание 6

n6 = int(input("Введите количество этажей"))-1
m6 = int(input("Введите количество людей"))
#1
A6 = razmech(n6, m6)/razmechpov(n6, m6) 
#2
B6 = n6*(n6-1)*m6
#3
C6= (n6)/(n6**3)
print(A6, B6, C6)

#задание 7

kol = int(input("Введите количество выбранных карт"))
n7 = sochet(36, kol)
m7 = 4*4*(36-kol)
PA7=m7/n7
print(PA7)

#задание 8

I8 = ((input("Введите уровень прибыли 1 предприятия"))/100)
II8 = (int(input("Введите уровень прибыли 2 предприятия"))/100)
III8 = (int(input("Введите уровень прибыли 3 предприятия"))/100)
#1
A8 = I8 * II8 * III8
#2
B8 = A8+(I8*I8)+(II8 * III8)*2
print(A8, B8, )

#задание 9

I9 = int(input("Введите ответа на 1 вопрос"))
II9 = int(input("Введите ответа на 2 вопрос"))
III9 = int(input("Введите ответа на 3 вопрос"))
#1
A9 = I9 * II8 * III8
#2
B9 = A9+(I9*II9)+(II9 * III9)+(I9 * III9)
print(A9, B9)

#задание 10

A10 = list(map(int(input("Введите количество человек в 1 группе и количество отличников через пробел")).split()))
B10 = list(map(int(input("Введите количество человек в 2 группе и количество отличников через пробел")).split()))
C10 = list(map(int(input("Введите количество человек в 3 группе и количество отличников через пробел")).split()))
PH1 = PH2 = PH3 = 1/3
for i in range(A10):
    PAH1 = A10[i]/A10[i+1]
for i in range(B10):
    PAH2 = B10[i]/B10[i+1]
for i in range(C10):
    PAH3 = C10[i]/C10[i+1]
PA10 = (PAH1*PH1)+(PAH2*PH2)+(PAH3*PH3)
print(PA10)
