def factor(f):
    if f == 1:
        return 1
    else:
        return factor(f-1)*f

def sochet(k, k1):
    o = factor(k)/(factor(k1) * factor(k-k1))
    return o

def razmechpov(rr, rr1):
    hrr = rr**(rr1)
    return hrr
def razmech(r, r1):
    hr = factor(r)/((factor(r-r1)))
    return hr
def fpoln(Phi, sumph):
    O = Phi*sumph
    return O

#задание 1 В урне 4 белых и 6 черных шаров. Из урны наудачу извлечены 2 шара. Найти вероятность того, что они разного цвета.

s1 = int(input("Введите количество белых шаров "))
s2 = int(input("Введите количество  черных шаров "))
PA1= (sochet(s1, 1) * sochet(s2, 1))/(sochet(s1+s2, 2))
print(PA1)

# #задание 2 Какова вероятность того, что пятизначное число состоит из цифр 0, 1, 2, 3, 4.

m = int(input("Введите количество знаков"))
n = int(input("Введите количество чисел"))
PA2 = ((m-1)*(m**(m-1)))/(((m+n-1))*((m+n)**(m-1)))
print(PA2)


# #задание 3 Студент  сдает  три  экзамена.
# Вероятность  успешной  сдачи  первого  экзамена  0,9,  второго  –  0,65,  третьего  –  0,35.
# Найти  вероятность  того,  что  он  не  сдаст  хотя  бы  один экзамен.

I3 = float(input("Введите ввероятность сдачи 1 экзамена "))
II3 = float(input("Введите ввероятность сдачи 2 экзамена "))
III3 = float(input("Введите ввероятность сдачи 1 экзамена "))
PAO = I3*II3*III3
PA3 = (1 - PAO)
print(PA3)

# #задание 4
# Пароль для входа в компьютерную базу данных состоит из 7 цифр.
# Какова вероятность правильного набора пароля с первого раза,
# если комбинация цифр является строго возрастающей последовательностью.

n4=int(input("Введите количество чисел в пароле"))
m4 = int(input("Введите количество попыток"))
PA4 = m4/(sochet(10, 10-n4))
print(PA4)


# #задание 5 Бросают игральный кубик.
# Какова вероятность того, что выпало четное число очков,
# если известно, что число выпавших очков меньше пяти?

m5 = 2
n5 = 4
PA5 = 2/4
print(PA5)

# #задание 6 В лифт 20-этажного дома на первом этаже зашли 3 человека. И поехали.
# Найти вероятность того, что:
# а) они выйдут на разных этажах;
# б) двое выйдут на одном этаже;
# в) все выйдут на одном этаже.

n6 = int(input("Введите количество этажей"))-1
m6 = int(input("Введите количество людей"))
#1
A6 = razmech(n6, m6)/razmechpov(n6, m6)
#2
B6 = (n6*(n6-1)*m6)/(razmechpov(n6, m6))
#3
C6= (n6)/(n6**3)
print(A6, B6, C6)

#задание 7 Из 36 карт наугад выбираются 3.
# Вычислите вероятность того, что среди них будут король и дама.

kol = int(input("Введите количество выбранных карт"))
cev = int(input("Введите количество желаемых карт"))
n7 = sochet(36, kol)
m7 = (cev*2*4)*(36-kol)
PA7=m7/n7
print(PA7)


# #задание 8 Для трех розничных торговых предприятий определен плановый уровень
# прибыли.
# Вероятность того, что первое предприятие выполнит план прибыли, равна 90%, для второго она составляет 95%, для третьего 100%.
# Какова вероятность того, что плановый уровень прибыли будет достигнут: а) всеми предприятиями; б) только двумя предприятиями; в) хотя бы одним предприятием.

I8 = (int(input("Введите уровень прибыли 1 предприятия"))/100)
II8 = (int(input("Введите уровень прибыли 2 предприятия"))/100)
III8 = (int(input("Введите уровень прибыли 3 предприятия"))/100)
#1
A8 = I8 * II8 * III8
#2
B8 = I8*(1-II8)+(II8*(1-I8))
print(A8, B8, III8)

# #задание 9 Экзаменационный  билет  содержит  3  вопроса.
# Вероятности  того,  что  студент
# ответит на первый и второй вопросы одинаковы и равны 0,9; на третий – 0,8.
# Найти вероятность того, что студент ответит: а) на все вопросы; б) по крайней мере, на два вопроса.

I9 = float(input("Введите вероятность правильного ответа на 1 вопрос"))
II9 = float(input("Введите вероятность правильного оответа на 2 вопрос"))
III9 = float(input("Введите вероятность правильного оответа на 3 вопрос"))
#1
A9 = I9 * II9 * III9
#2
B9 = A9+(I9*II9)+(II9 * III9)+(I9 * III9) #почему
if B9>1:
    B9=1
print(A9, B9)

#задание 10 Была  проведена  одна  и  та  же  контрольная  работа  в  трех  группах.
# В  первой группе  из  30  студентов  8  выполнили  работу  на  «отлично»,
# во  второй,  где  28  студентов,  –  6 «отличных»  работ,  в  третьей,  где  27  студентов,  –  9  работ  выполнены  на  «отлично».
#Найти вероятность  того,  что  первая  выбранная  наудачу  работа  из  работ,  принадлежащих  группе, которая также выбрана наудачу, окажется «отличной».

A10 = [int(value) for value in input("Введите количество человек в 1 группе и количество отличников через пробел").split()]
B10 = [int(value) for value in input("Введите количество человек в 2 группе и количество отличников через пробел").split()]
C10 = [int(value) for value in input("Введите количество человек в 3 группе и количество отличников через пробел").split()]
PH1 = PH2 = PH3 = (1/3)
for i in range(len(A10)):
    PAH1 = (A10[i])/(A10[i-1])
for j in range(len(B10)):
    PAH2 = (B10[j])/(B10[j-1])
for i in range(len(C10)):
    PAH3 = (C10[i])/(C10[i-1])
PA10 = (PAH1*PH1)+(PAH2*PH2)+(PAH3*PH3)
print(PA10)

#11

n11 = int(input( "Введите количество путей, предоставленных туристу" ) )
PH10 = [float(value) for value in input( "Введите вероятность выхода для каждого пути через пробел").split()]
i10 = int(input("Вероятность выбора какой тропы нужно высчитать?"))-1
Ph10 = 1 / (n11)
sumPH10 = 0
for i in range(len(PH10)):
     sumPH10 = sumPH10 + PH10[i]
print(PH10[i10])
ph10A = fbayer(Ph10, PH10[i10], fpoln(Ph10, sumPH10))
print(ph10A)

# 12

Phi111 = int(input("Введите процент количества деталей, производимых 1 цехом"))/100
Phi112 = int(input("Введите процент количества деталей, производимых 2 цехом"))/100
Pah111 = 1 - float(input("Введите вероятность брака 1 цеха"))
Pah112 = 1 - float(input("Введите вероятность брака 2 цеха"))
pa12 = (Pah111 * Phi111) + (Pah112 * Phi112)
PhiA12 = fbayer(Phi111, Pah111, pa12)
print(PhiA12)

# 13

r1 = int(input("Введите часть соотношения грузовых машин"))
r2 = int(input("Введите часть соотношения легковых машин"))
z1 = float(input("заправка грузовых"))
z2 = float(input("заправка легковых"))
Ph131 = r1/(r1+r2)
Ph132 = r2/(r1+r2)
Pa13 = r1*z1 + r2* z2
PhA131 = fbayer(Ph131, z1, Pa13)
print(PhA131)

# 14


Ph141 = float(input("Количество ламп с 1 завода"))
Ph142 = float(input("Количество ламп с 2 завода"))
Ph143 = 1- Ph141- Ph142
PAh141 = float(input("Введите вероятность брака 1 цеха"))
PAh142 = float(input("Введите вероятность брака 2 цеха"))
PAh143 = float(input("Введите вероятность брака 3 цеха"))
PA14 = Ph141*PAh141 + Ph142*PAh142 + Ph143*PAh143
Pha141 = fbayer(Ph141, PAh141, PA14)
Pha142 = fbayer(Ph142, PAh142, PA14)
Pha143 = fbayer(Ph143, PAh143, PA14)
print(Pha141, Pha142, Pha143)

# 15

PaH151 = 6/12
PaH152 = 5/12
PaH153 = 4/12
Ph151 = sochet(3, 3) * sochet(4,2) / sochet(7,5)
Ph152 = sochet(3,2) * sochet(4,3) / sochet(7,5)
Ph153 = sochet(3,1) * sochet(4,4) / sochet(7,5)
Pa15 = PaH151 * Ph151 + PaH152 * Ph152+ PaH153 * Ph153
print(Pa15)

# 16

x = int(input("Введите количество банков"))
x1 = int(input("Введите количество банков с нарушением"))
x2 = int(input("Введите количество проверяемых банков"))
p = float(input("Введите вероятность нарушения"))
Ph160 = sochet(0, x1)* sochet(x-x1, x2)/ (x, x2)
Ph161 = sochet(1, x1-1)* sochet(x-x1, x2-1)/ (x, x2)
Ph162 = sochet(2, x1-2)* sochet(x-x1, x2-2)/ (x, x2)
Ph163 = sochet(3, x1-3)* sochet(x-x1, x2-3)/ (x, x2)
Pah160= 1-(1-p)^0
Pah161= 1-(1-p)^1
Pah162= 1-(1-p)^2
Pah163= 1-(1-p)^3
Pa16 = Ph160* Pah160 + Ph161* Pah161+ Ph162* Pah162+ Ph163* Pah163




# 17

P17 = [float(value) for value in input( "Введите вероятность выхода из строя через пробел").split()]
Pn17 = (1-P17[0])*(1 - (P17[1] + P17[2] + P17[3] + P17[4]))
print(Pn17)
