def factor(f):
    if f == 1:
        return 1
    if f == 0:
        return 1
    else:
        return factor(f-1)*f

def sochet(k, k1):
    o = factor(k)/(factor(k1) * factor(k-k1))
    return o

def fbernuli(n, k, p, q):
    x = sochet(n, k)*(p**(k))* (q**(n-k))
    return x

#1В среднем 20% пакетов акций на аукционах продаются по первоначально заявленной цене. 
# Найти вероятность того, что из 9 пакетов акций в результате торгов по первоначально заявленной цене: 
#     1) не будут проданы 5 пакетов; 
#     2) будет продано: а) менее 2 пакетов; б) не более 2; в) хотя бы 2 пакета; г) наивероятнейшее число пакетов
A1 = int(input("Сколько пакетов продаются по первоначальной цене?"))/100
n1 = int(input("Сколько пакетов продается?"))
Pan = int(input("Сколько пакетов не продано?"))
P1 = 1-A1
#1
Pa11 =  fbernuli(n1, Pan, P1, A1) #вероятность того, что не продано n пакетов
#2a
k11 = 1
k10 = 0
k12=2
Pa12 =  fbernuli(n1, k11, A1, P1) + fbernuli(n1, k10, A1, P1)
#2b
Pa13 = fbernuli(n1, k11, A1, P1) + fbernuli(n1, k10, A1, P1) + fbernuli(n1, k12, A1, P1)
#2c
Pa14 = 1- fbernuli(n1, k11, A1, P1) - fbernuli(n1, k10, A1, P1)
#2d 
k11D = n1* A1 - P1
k12D = n1*A1 + A1
Pa15 = fbernuli(n1, k11D, A1, P1) + fbernuli(n1, k12D, A1, P1)

#2 Сколько раз необходимо подбросить игральную кость, чтобы наивероятнейшее выпадение тройки было равно 10? 

k = int(input("Введите наивероятнейшее число выпадения числа"))
p = 1/6
q = 1-1/6
n1 = (k +q)/ p
n2 = (k -p)/ p
print(n2, n1)
print(Pa11, Pa12, Pa13, Pa14, Pa15)

#3 Сколько следует сыграть партий в шахматы с вероятностью победы в одной партии, равной 1/3, чтобы наивероятнейшее число побед было равно 5?
k = int(input("Введите наивероятнейшее число побед:"))
p = float(input("Введите вероятность:"))
q = 1-p
n1 = (k + q) / p
n2 = (k - p) / p
print(n2, n1)

#4 Пусть вероятность того, что телевизор потребует ремонта в течение гарантийного срока, равна 0,2. 
# Найти вероятность того, что в течение гарантийного срока из 6 телевизоров: 
# а) не более одного потребует ремонта; б) хотя бы один не потребует ремонта.

p4 = float(input("Введите вероятность поломки в течение года"))
q6 = 1-p4
n6 = int(input("Введите количество телевизоров"))
k40 =0
k41 =1
k46 = 6
Pa4 = fbernuli(n6, k40, p4, q6) + fbernuli(n6, k41, p4, q6)
Pb4 = 1- fbernuli(n6, k46, p4, q6)
print ( Pa4, Pb4)

#5 Что более вероятно выиграть у равносильного противника: не менее двух партий из трёх или не более одной из двух?
p5 = 0.5
q5 = 1- p5
#1
n51 =3 
k51 = 2
k52 = 3
#2
n52 = 2
k53 = 0
k54 = 1


Pa5 = fbernuli(n51, k51, p5, q5)+ fbernuli(n51, k52, p5, q5)
Pb5 = fbernuli(n52, k53, p5, q5) + fbernuli(n52, k54, p5, q5)
if Pa5 > Pb5:
    print("a: ",Pa5)
if Pb5 > Pa5:
    print("B: ", Pb5)



